neohung/neo_sk-fm4-176l-s6e2cc-voi/cmsis/svd/s6e2ccxl.svd
<?xml version="1.0" encoding="utf-8"?>
<!-- ******************************************************************************** -->
<!-- Copyright (C) 2013-2015, Cypress Semiconductor Corporation. All Rights Reserved. -->
<!--                                                                                  -->
<!-- This software, including source code, documentation and related                  -->
<!-- materials ( "Software" ), is owned by Cypress Semiconductor                      -->
<!-- Corporation ( "Cypress" ) and is protected by and subject to worldwide           -->
<!-- patent protection (United States and foreign), United States copyright           -->
<!-- laws and international treaty provisions. Therefore, you may use this            -->
<!-- Software only as provided in the license agreement accompanying the              -->
<!-- software package from which you obtained this Software ( "EULA" ).               -->
<!-- If no EULA applies, Cypress hereby grants you a personal, nonexclusive,          -->
<!-- non-transferable license to copy, modify, and compile the                        -->
<!-- Software source code solely for use in connection with Cypress's                -->
<!-- integrated circuit products. Any reproduction, modification, translation,        -->
<!-- compilation, or representation of this Software except as specified              -->
<!-- above is prohibited without the express written permission of Cypress.           -->
<!-- Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO                             -->
<!-- WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING,                             -->
<!-- BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED                                     -->
<!-- WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A                                  -->
<!-- PARTICULAR PURPOSE. Cypress reserves the right to make                           -->
<!-- changes to the Software without notice. Cypress does not assume any              -->
<!-- liability arising out of the application or use of the Software or any           -->
<!-- product or circuit described in the Software. Cypress does not                   -->
<!-- authorize its products for use in any products where a malfunction or            -->
<!-- failure of the Cypress product may reasonably be expected to result in           -->
<!-- significant property damage, injury or death ( "High Risk Product" ). By         -->
<!-- including Cypress's product in a High Risk Product, the manufacturer            -->
<!-- of such system or application assumes all risk of such use and in doing          -->
<!-- so agrees to indemnify Cypress against all liability.                            -->
<!-- ******************************************************************************** -->
<!-- 2015.08.27 generated by svdgen_v03g -->
<device schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_0.xsd">
  <vendor>Cypress</vendor>
  <name>S6E2CCxL</name>
  <version>2.0</version>
  <description>S6E2CC Series package L</description>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <size>32</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0x00000000</resetMask>
  <cpu>
    <name>CM4</name>
    <revision>r0p1</revision>
    <endian>little</endian>
    <mpuPresent>true</mpuPresent>
    <fpuPresent>true</fpuPresent>
    <fpuDP>false</fpuDP>
    <icachePresent>false</icachePresent>
    <dcachePresent>false</dcachePresent>
    <itcmPresent>false</itcmPresent>
    <dtcmPresent>false</dtcmPresent>
    <vtorPresent>false</vtorPresent>
    <nvicPrioBits>4</nvicPrioBits>
    <vendorSystickConfig>false</vendorSystickConfig>
  </cpu>
  <vendorExtensions>
    <mcutype>3</mcutype>
  </vendorExtensions>
  <peripherals>
    <!-- PERIPHERAL "FLASH_IF" -->
    <peripheral>
      <name>FLASH_IF</name>
      <description>Flash Memory</description>
      <version>B</version>
      <groupName>FLASH_IF</groupName>
      <baseAddress>0x40000000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x20</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x30</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x100</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x110</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "FLASHIF" -->
      <interrupt>
        <name>FLASHIF</name>
        <value>119</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "FASZR" -->
        <register>
          <name>FASZR</name>
          <description>Flash Access Size Register</description>
          <addressOffset>0x00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <resetMask>0x00000003</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ASZ" -->
            <field>
              <name>ASZ</name>
              <description>Access Size</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FRWTR" -->
        <register>
          <name>FRWTR</name>
          <description>Flash Read Wait Register</description>
          <addressOffset>0x04</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000003</resetValue>
          <resetMask>0x00000003</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RWT" -->
            <field>
              <name>RWT</name>
              <description>Read Wait Cycle</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FSTR" -->
        <register>
          <name>FSTR</name>
          <description>Flash Status Register</description>
          <addressOffset>0x08</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ERR" -->
            <field>
              <name>ERR</name>
              <description>Flash ECC Error</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "HNG" -->
            <field>
              <name>HNG</name>
              <description>Flash Hang</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RDY" -->
            <field>
              <name>RDY</name>
              <description>Flash Rdy</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FSYNDN" -->
        <register>
          <name>FSYNDN</name>
          <description>Flash Sync Down Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SD" -->
            <field>
              <name>SD</name>
              <description>Sync Down</description>
              <msb>2</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
