neohung/neo_sk-fm4-176l-s6e2cc-voi/cmsis/svd/s6e2ccxl.svd
        <!-- REGISTER "FBFCR" -->
        <register>
          <name>FBFCR</name>
          <description>Flash Buffer Control Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BS" -->
            <field>
              <name>BS</name>
              <description>Buffer Status</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BE" -->
            <field>
              <name>BE</name>
              <description>Buffer Enable</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FICR" -->
        <register>
          <name>FICR</name>
          <description>Flash Interrupt Control Register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ERRIE" -->
            <field>
              <name>ERRIE</name>
              <description>Flash ECC Error Interrupt Enable</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "HNGIE" -->
            <field>
              <name>HNGIE</name>
              <description>Flash HANG Interrupt Enable</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RDYIE" -->
            <field>
              <name>RDYIE</name>
              <description>Flash RDY Interrupt Enable</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FISR" -->
        <register>
          <name>FISR</name>
          <description>Flash Interrupt Status Register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ERRIF" -->
            <field>
              <name>ERRIF</name>
              <description>Flash ECC Error Interrupt Flag</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "HNGIF" -->
            <field>
              <name>HNGIF</name>
              <description>Flash HANG Interrupt Flag</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RDYIF" -->
            <field>
              <name>RDYIF</name>
              <description>Flash RDY Interrupt Flag</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FICLR" -->
        <register>
          <name>FICLR</name>
          <description>Flash Interrupt Clear Register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ERRIC" -->
            <field>
              <name>ERRIC</name>
              <description>Flash ECC Error Interrupt Clear</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "HNGIC" -->
            <field>
              <name>HNGIC</name>
              <description>Flash HANG Interrupt Clear </description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RDYIC" -->
            <field>
              <name>RDYIC</name>
              <description>Flash RDY Interrupt Clear</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DFCTRLR" -->
        <register>
          <name>DFCTRLR</name>
          <description>Dual Flash mode Control Register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFF0003</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WKEY" -->
            <field>
              <name>WKEY</name>
              <description>Write Key</description>
              <msb>31</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RME" -->
            <field>
              <name>RME</name>
              <description>Re-Map Enable</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DFE" -->
            <field>
              <name>DFE</name>
              <description>Dual Flash mode Enable</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CRTRMM" -->
        <register>
          <name>CRTRMM</name>
          <description>CR Trimming Data Mirror Register</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TTRMM" -->
            <field>
              <name>TTRMM</name>
              <description>Temperature CR Trimming Data Mirror</description>
              <msb>20</msb>
              <lsb>16</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRMM" -->
            <field>
              <name>TRMM</name>
              <description>CR Trimming Data Mirror</description>
              <msb>9</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
