neohung/neo_sk-fm4-176l-s6e2cc-voi/cmsis/svd/s6e2ccxl.svd
        <!-- REGISTER "ODDPKS1" -->
        <register>
          <name>ODDPKS1</name>
          <description>USB ch.1 Odd Packet Size DMA Enable Register</description>
          <addressOffset>0x14</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ODDPKS14" -->
            <field>
              <name>ODDPKS14</name>
              <description>"If the transfer destination address of DMAC is USB.EP5DT, the bit width of the last transfer data is converted to Byte."</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ODDPKS13" -->
            <field>
              <name>ODDPKS13</name>
              <description>"If the transfer destination address of DMAC is USB.EP4DT, the bit width of the last transfer data is converted to Byte."</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ODDPKS12" -->
            <field>
              <name>ODDPKS12</name>
              <description>"If the transfer destination address of DMAC is USB.EP3DT, the bit width of the last transfer data is converted to Byte."</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ODDPKS11" -->
            <field>
              <name>ODDPKS11</name>
              <description>"If the transfer destination address of DMAC is USB.EP2DT, the bit width of the last transfer data is converted to Byte."</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ODDPKS10" -->
            <field>
              <name>ODDPKS10</name>
              <description>"If the transfer destination address of DMAC is USB.EP1DT, the bit width of the last transfer data is converted to Byte."</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ003SEL" -->
        <register>
          <name>IRQ003SEL</name>
          <description>Relocate Interrupt Selection Register (IRQ003)</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF00FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SELBIT15" -->
            <field>
              <name>SELBIT15</name>
              <description>Bit15 of the interrupt source is moved to bit15 of the relocate interrupt.</description>
              <msb>31</msb>
              <lsb>31</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT14" -->
            <field>
              <name>SELBIT14</name>
              <description>Bit14 of the interrupt source is moved to bit14 of the relocate interrupt.</description>
              <msb>30</msb>
              <lsb>30</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT13" -->
            <field>
              <name>SELBIT13</name>
              <description>Bit13 of the interrupt source is moved to bit13 of the relocate interrupt.</description>
              <msb>29</msb>
              <lsb>29</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT12" -->
            <field>
              <name>SELBIT12</name>
              <description>Bit12 of the interrupt source is moved to bit12 of the relocate interrupt.</description>
              <msb>28</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT11" -->
            <field>
              <name>SELBIT11</name>
              <description>Bit11 of the interrupt source is moved to bit11 of the relocate interrupt.</description>
              <msb>27</msb>
              <lsb>27</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT10" -->
            <field>
              <name>SELBIT10</name>
              <description>Bit10 of the interrupt source is moved to bit10 of the relocate interrupt.</description>
              <msb>26</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT9" -->
            <field>
              <name>SELBIT9</name>
              <description>Bit9 of the interrupt source is moved to bit9 of the relocate interrupt.</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT8" -->
            <field>
              <name>SELBIT8</name>
              <description>Bit8 of the interrupt source is moved to bit8 of the relocate interrupt.</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT7" -->
            <field>
              <name>SELBIT7</name>
              <description>Bit7 of the interrupt source is moved to bit7 of the relocate interrupt.</description>
              <msb>23</msb>
              <lsb>23</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT6" -->
            <field>
              <name>SELBIT6</name>
              <description>Bit6 of the interrupt source is moved to bit6 of the relocate interrupt.</description>
              <msb>22</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT5" -->
            <field>
              <name>SELBIT5</name>
              <description>Bit5 of the interrupt source is moved to bit5 of the relocate interrupt.</description>
              <msb>21</msb>
              <lsb>21</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT4" -->
            <field>
              <name>SELBIT4</name>
              <description>Bit4 of the interrupt source is moved to bit4 of the relocate interrupt.</description>
              <msb>20</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT3" -->
            <field>
              <name>SELBIT3</name>
              <description>Bit3 of the interrupt source is moved to bit3 of the relocate interrupt.</description>
              <msb>19</msb>
              <lsb>19</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT2" -->
            <field>
              <name>SELBIT2</name>
              <description>Bit2 of the interrupt source is moved to bit2 of the relocate interrupt.</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT1" -->
            <field>
              <name>SELBIT1</name>
              <description>Bit1 of the interrupt source is moved to bit1 of the relocate interrupt.</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT0" -->
            <field>
              <name>SELBIT0</name>
              <description>Bit0 of the interrupt source is moved to bit0 of the relocate interrupt.</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELIRQ" -->
            <field>
              <name>SELIRQ</name>
              <description>specify the IRQ no. of a peripheral interrupt to be relocated</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ004SEL" -->
        <register>
          <name>IRQ004SEL</name>
          <description>Relocate Interrupt Selection Register (IRQ004)</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF00FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SELBIT15" -->
            <field>
              <name>SELBIT15</name>
              <description>Bit15 of the interrupt source is moved to bit15 of the relocate interrupt.</description>
              <msb>31</msb>
              <lsb>31</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT14" -->
            <field>
              <name>SELBIT14</name>
              <description>Bit14 of the interrupt source is moved to bit14 of the relocate interrupt.</description>
              <msb>30</msb>
              <lsb>30</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT13" -->
            <field>
              <name>SELBIT13</name>
              <description>Bit13 of the interrupt source is moved to bit13 of the relocate interrupt.</description>
              <msb>29</msb>
              <lsb>29</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT12" -->
            <field>
              <name>SELBIT12</name>
              <description>Bit12 of the interrupt source is moved to bit12 of the relocate interrupt.</description>
              <msb>28</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT11" -->
            <field>
              <name>SELBIT11</name>
              <description>Bit11 of the interrupt source is moved to bit11 of the relocate interrupt.</description>
              <msb>27</msb>
              <lsb>27</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT10" -->
            <field>
              <name>SELBIT10</name>
              <description>Bit10 of the interrupt source is moved to bit10 of the relocate interrupt.</description>
              <msb>26</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT9" -->
            <field>
              <name>SELBIT9</name>
              <description>Bit9 of the interrupt source is moved to bit9 of the relocate interrupt.</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT8" -->
            <field>
              <name>SELBIT8</name>
              <description>Bit8 of the interrupt source is moved to bit8 of the relocate interrupt.</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT7" -->
            <field>
              <name>SELBIT7</name>
              <description>Bit7 of the interrupt source is moved to bit7 of the relocate interrupt.</description>
              <msb>23</msb>
              <lsb>23</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT6" -->
            <field>
              <name>SELBIT6</name>
              <description>Bit6 of the interrupt source is moved to bit6 of the relocate interrupt.</description>
              <msb>22</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT5" -->
            <field>
              <name>SELBIT5</name>
              <description>Bit5 of the interrupt source is moved to bit5 of the relocate interrupt.</description>
              <msb>21</msb>
              <lsb>21</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT4" -->
            <field>
              <name>SELBIT4</name>
              <description>Bit4 of the interrupt source is moved to bit4 of the relocate interrupt.</description>
              <msb>20</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT3" -->
            <field>
              <name>SELBIT3</name>
              <description>Bit3 of the interrupt source is moved to bit3 of the relocate interrupt.</description>
              <msb>19</msb>
              <lsb>19</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT2" -->
            <field>
              <name>SELBIT2</name>
              <description>Bit2 of the interrupt source is moved to bit2 of the relocate interrupt.</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT1" -->
            <field>
              <name>SELBIT1</name>
              <description>Bit1 of the interrupt source is moved to bit1 of the relocate interrupt.</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT0" -->
            <field>
              <name>SELBIT0</name>
              <description>Bit0 of the interrupt source is moved to bit0 of the relocate interrupt.</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELIRQ" -->
            <field>
              <name>SELIRQ</name>
              <description>specify the IRQ no. of a peripheral interrupt to be relocated</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ005SEL" -->
        <register>
          <name>IRQ005SEL</name>
          <description>Relocate Interrupt Selection Register (IRQ005)</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF00FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SELBIT15" -->
            <field>
              <name>SELBIT15</name>
              <description>Bit15 of the interrupt source is moved to bit15 of the relocate interrupt.</description>
              <msb>31</msb>
              <lsb>31</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT14" -->
            <field>
              <name>SELBIT14</name>
              <description>Bit14 of the interrupt source is moved to bit14 of the relocate interrupt.</description>
              <msb>30</msb>
              <lsb>30</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT13" -->
            <field>
              <name>SELBIT13</name>
              <description>Bit13 of the interrupt source is moved to bit13 of the relocate interrupt.</description>
              <msb>29</msb>
              <lsb>29</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT12" -->
            <field>
              <name>SELBIT12</name>
              <description>Bit12 of the interrupt source is moved to bit12 of the relocate interrupt.</description>
              <msb>28</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT11" -->
            <field>
              <name>SELBIT11</name>
              <description>Bit11 of the interrupt source is moved to bit11 of the relocate interrupt.</description>
              <msb>27</msb>
              <lsb>27</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT10" -->
            <field>
              <name>SELBIT10</name>
              <description>Bit10 of the interrupt source is moved to bit10 of the relocate interrupt.</description>
              <msb>26</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT9" -->
            <field>
              <name>SELBIT9</name>
              <description>Bit9 of the interrupt source is moved to bit9 of the relocate interrupt.</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT8" -->
            <field>
              <name>SELBIT8</name>
              <description>Bit8 of the interrupt source is moved to bit8 of the relocate interrupt.</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT7" -->
            <field>
              <name>SELBIT7</name>
              <description>Bit7 of the interrupt source is moved to bit7 of the relocate interrupt.</description>
              <msb>23</msb>
              <lsb>23</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT6" -->
            <field>
              <name>SELBIT6</name>
              <description>Bit6 of the interrupt source is moved to bit6 of the relocate interrupt.</description>
              <msb>22</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT5" -->
            <field>
              <name>SELBIT5</name>
              <description>Bit5 of the interrupt source is moved to bit5 of the relocate interrupt.</description>
              <msb>21</msb>
              <lsb>21</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT4" -->
            <field>
              <name>SELBIT4</name>
              <description>Bit4 of the interrupt source is moved to bit4 of the relocate interrupt.</description>
              <msb>20</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT3" -->
            <field>
              <name>SELBIT3</name>
              <description>Bit3 of the interrupt source is moved to bit3 of the relocate interrupt.</description>
              <msb>19</msb>
              <lsb>19</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT2" -->
            <field>
              <name>SELBIT2</name>
              <description>Bit2 of the interrupt source is moved to bit2 of the relocate interrupt.</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT1" -->
            <field>
              <name>SELBIT1</name>
              <description>Bit1 of the interrupt source is moved to bit1 of the relocate interrupt.</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT0" -->
            <field>
              <name>SELBIT0</name>
              <description>Bit0 of the interrupt source is moved to bit0 of the relocate interrupt.</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELIRQ" -->
            <field>
              <name>SELIRQ</name>
              <description>specify the IRQ no. of a peripheral interrupt to be relocated</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
