neohung/neo_sk-fm4-176l-s6e2cc-voi/cmsis/svd/s6e2ccxl.svd
        <!-- REGISTER "IRQ045MON" -->
        <register>
          <name>IRQ045MON</name>
          <description>IRQ045 Batch Read Register</description>
          <addressOffset>0x2B8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BTINT1" -->
            <field>
              <name>BTINT1</name>
              <description>Interrupt request of source 1 (IRQ1) of the base timer ch.6</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT0" -->
            <field>
              <name>BTINT0</name>
              <description>Interrupt request of source 0 (IRQ0) of the base timer ch.6</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ046MON" -->
        <register>
          <name>IRQ046MON</name>
          <description>IRQ046 Batch Read Register</description>
          <addressOffset>0x2BC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BTINT1" -->
            <field>
              <name>BTINT1</name>
              <description>Interrupt request of source 1 (IRQ1) of the base timer ch.7</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT0" -->
            <field>
              <name>BTINT0</name>
              <description>Interrupt request of source 0 (IRQ0) of the base timer ch.7</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ047MON" -->
        <register>
          <name>IRQ047MON</name>
          <description>IRQ047 Batch Read Register</description>
          <addressOffset>0x2C0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TIMINT2" -->
            <field>
              <name>TIMINT2</name>
              <description>Dual timer TIMINT2 interrupt request</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TIMINT1" -->
            <field>
              <name>TIMINT1</name>
              <description>Dual timer TIMINT1 interrupt request</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ048MON" -->
        <register>
          <name>IRQ048MON</name>
          <description>IRQ048 Batch Read Register</description>
          <addressOffset>0x2C4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WCINT" -->
            <field>
              <name>WCINT</name>
              <description>Interrupt request of the watch counter</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ049MON" -->
        <register>
          <name>IRQ049MON</name>
          <description>IRQ049 Batch Read Register</description>
          <addressOffset>0x2C8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BMEMCS" -->
            <field>
              <name>BMEMCS</name>
              <description>External bus output error interrupt request</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ050MON" -->
        <register>
          <name>IRQ050MON</name>
          <description>IRQ050 Batch Read Register</description>
          <addressOffset>0x2CC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RTCINT" -->
            <field>
              <name>RTCINT</name>
              <description>Interrupt request of the RTC$</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ051MON" -->
        <register>
          <name>IRQ051MON</name>
          <description>IRQ051 Batch Read Register</description>
          <addressOffset>0x2D0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EXTINT" -->
            <field>
              <name>EXTINT</name>
              <description>Interrupt request of the external pin interrupt ch.8</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ052MON" -->
        <register>
          <name>IRQ052MON</name>
          <description>IRQ052 Batch Read Register</description>
          <addressOffset>0x2D4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EXTINT" -->
            <field>
              <name>EXTINT</name>
              <description>Interrupt request of the external pin interrupt ch.9</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
