neohung/neo_sk-fm4-176l-s6e2cc-voi/cmsis/svd/s6e2ccxl.svd
        <!-- REGISTER "BREG3F" -->
        <register>
          <name>BREG3F</name>
          <description>Backup Register</description>
          <addressOffset>0x13F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG40" -->
        <register>
          <name>BREG40</name>
          <description>Backup Register</description>
          <addressOffset>0x140</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG41" -->
        <register>
          <name>BREG41</name>
          <description>Backup Register</description>
          <addressOffset>0x141</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG42" -->
        <register>
          <name>BREG42</name>
          <description>Backup Register</description>
          <addressOffset>0x142</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG43" -->
        <register>
          <name>BREG43</name>
          <description>Backup Register</description>
          <addressOffset>0x143</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG44" -->
        <register>
          <name>BREG44</name>
          <description>Backup Register</description>
          <addressOffset>0x144</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG45" -->
        <register>
          <name>BREG45</name>
          <description>Backup Register</description>
          <addressOffset>0x145</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG46" -->
        <register>
          <name>BREG46</name>
          <description>Backup Register</description>
          <addressOffset>0x146</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG47" -->
        <register>
          <name>BREG47</name>
          <description>Backup Register</description>
          <addressOffset>0x147</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG48" -->
        <register>
          <name>BREG48</name>
          <description>Backup Register</description>
          <addressOffset>0x148</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG49" -->
        <register>
          <name>BREG49</name>
          <description>Backup Register</description>
          <addressOffset>0x149</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG4A" -->
        <register>
          <name>BREG4A</name>
          <description>Backup Register</description>
          <addressOffset>0x14A</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG4B" -->
        <register>
          <name>BREG4B</name>
          <description>Backup Register</description>
          <addressOffset>0x14B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG4C" -->
        <register>
          <name>BREG4C</name>
          <description>Backup Register</description>
          <addressOffset>0x14C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG4D" -->
        <register>
          <name>BREG4D</name>
          <description>Backup Register</description>
          <addressOffset>0x14D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG4E" -->
        <register>
          <name>BREG4E</name>
          <description>Backup Register</description>
          <addressOffset>0x14E</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG4F" -->
        <register>
          <name>BREG4F</name>
          <description>Backup Register</description>
          <addressOffset>0x14F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG50" -->
        <register>
          <name>BREG50</name>
          <description>Backup Register</description>
          <addressOffset>0x150</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG51" -->
        <register>
          <name>BREG51</name>
          <description>Backup Register</description>
          <addressOffset>0x151</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG52" -->
        <register>
          <name>BREG52</name>
          <description>Backup Register</description>
          <addressOffset>0x152</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
