neohung/neo_sk-fm4-176l-s6e2cc-voi/cmsis/svd/s6e2ccxl.svd
        <!-- REGISTER "BREG53" -->
        <register>
          <name>BREG53</name>
          <description>Backup Register</description>
          <addressOffset>0x153</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG54" -->
        <register>
          <name>BREG54</name>
          <description>Backup Register</description>
          <addressOffset>0x154</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG55" -->
        <register>
          <name>BREG55</name>
          <description>Backup Register</description>
          <addressOffset>0x155</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG56" -->
        <register>
          <name>BREG56</name>
          <description>Backup Register</description>
          <addressOffset>0x156</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG57" -->
        <register>
          <name>BREG57</name>
          <description>Backup Register</description>
          <addressOffset>0x157</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG58" -->
        <register>
          <name>BREG58</name>
          <description>Backup Register</description>
          <addressOffset>0x158</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG59" -->
        <register>
          <name>BREG59</name>
          <description>Backup Register</description>
          <addressOffset>0x159</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG5A" -->
        <register>
          <name>BREG5A</name>
          <description>Backup Register</description>
          <addressOffset>0x15A</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG5B" -->
        <register>
          <name>BREG5B</name>
          <description>Backup Register</description>
          <addressOffset>0x15B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG5C" -->
        <register>
          <name>BREG5C</name>
          <description>Backup Register</description>
          <addressOffset>0x15C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG5D" -->
        <register>
          <name>BREG5D</name>
          <description>Backup Register</description>
          <addressOffset>0x15D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG5E" -->
        <register>
          <name>BREG5E</name>
          <description>Backup Register</description>
          <addressOffset>0x15E</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG5F" -->
        <register>
          <name>BREG5F</name>
          <description>Backup Register</description>
          <addressOffset>0x15F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG60" -->
        <register>
          <name>BREG60</name>
          <description>Backup Register</description>
          <addressOffset>0x160</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG61" -->
        <register>
          <name>BREG61</name>
          <description>Backup Register</description>
          <addressOffset>0x161</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG62" -->
        <register>
          <name>BREG62</name>
          <description>Backup Register</description>
          <addressOffset>0x162</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG63" -->
        <register>
          <name>BREG63</name>
          <description>Backup Register</description>
          <addressOffset>0x163</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG64" -->
        <register>
          <name>BREG64</name>
          <description>Backup Register</description>
          <addressOffset>0x164</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
