neohung/neo_sk-fm4-176l-s6e2cc-voi/cmsis/svd/s6e2ccxl.svd
        <!-- REGISTER "TXFRAMECOUNT_GB" -->
        <register>
          <name>TXFRAMECOUNT_GB</name>
          <description>Number of good and bad frames transmitted, exclusive of retried frames</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "TXBROADCASTFRAMES_G" -->
        <register>
          <name>TXBROADCASTFRAMES_G</name>
          <description>Number of good broadcast frames transmitted</description>
          <addressOffset>0x11C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "TXMULTICASTFRAMES_G" -->
        <register>
          <name>TXMULTICASTFRAMES_G</name>
          <description>Number of good multicast frames transmitted</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "TX64OCTETS_GB" -->
        <register>
          <name>TX64OCTETS_GB</name>
          <description>Number of good and bad frames transmitted with length of 64 bytes, exclusive of preamble and retried frames</description>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "TX65TO127OCTETS_GB" -->
        <register>
          <name>TX65TO127OCTETS_GB</name>
          <description>Number of good and bad frames transmitted with length between 65 and 127 (inclusive) bytes, exclusive of preamble and retried frames</description>
          <addressOffset>0x128</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "TX128TO255OCTETS_GB" -->
        <register>
          <name>TX128TO255OCTETS_GB</name>
          <description>Number of good and bad frames transmitted with length between 128 and 255 (inclusive) bytes, exclusive of preamble and retried frames</description>
          <addressOffset>0x12C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "TX256TO511OCTETS_GB" -->
        <register>
          <name>TX256TO511OCTETS_GB</name>
          <description>Number of good and bad frames transmitted with length between 256 and 511 (inclusive) bytes, exclusive of preamble and retried frames</description>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "TX512TO1023OCTETS_GB" -->
        <register>
          <name>TX512TO1023OCTETS_GB</name>
          <description>Number of good and bad frames transmitted with length between 512 and 1023 (inclusive) bytes, exclusive of preamble and retried frames</description>
          <addressOffset>0x134</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "TX1024TOMAXOCTETS_GB" -->
        <register>
          <name>TX1024TOMAXOCTETS_GB</name>
          <description>Number of good and bad frames transmitted with length between 1024 and Maxsize (inclusive) bytes, exclusive of preamble and retried frames</description>
          <addressOffset>0x138</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "TXUNICASTFRAMES_GB" -->
        <register>
          <name>TXUNICASTFRAMES_GB</name>
          <description>Number of good and bad unicast frames transmitted</description>
          <addressOffset>0x13C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "TXMULTICASTFRAMES_GB" -->
        <register>
          <name>TXMULTICASTFRAMES_GB</name>
          <description>Number of good and bad multicast frames transmitted</description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "TXBROADCASTFRAMES_GB" -->
        <register>
          <name>TXBROADCASTFRAMES_GB</name>
          <description>Number of good and bad broadcast frames transmitted</description>
          <addressOffset>0x144</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "TXUNDERFLOWERROR" -->
        <register>
          <name>TXUNDERFLOWERROR</name>
          <description>Number of frames aborted due to frame underflow error</description>
          <addressOffset>0x148</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "TXSINGLECOL_G" -->
        <register>
          <name>TXSINGLECOL_G</name>
          <description>Number of successfully transmitted frames after a single collision in Half-duplex mode </description>
          <addressOffset>0x14C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "TXMULTICOL_G" -->
        <register>
          <name>TXMULTICOL_G</name>
          <description>Number of successfully transmitted frames after more than a single collision in Half-duplex mode</description>
          <addressOffset>0x150</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "TXDEFERRED" -->
        <register>
          <name>TXDEFERRED</name>
          <description>Number of successfully transmitted frames after a deferral in Half-duplex mode.</description>
          <addressOffset>0x154</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
