neohung/neo_sk-fm4-176l-s6e2cc-voi/cmsis/svd/s6e2ccxl.svd
        <!-- REGISTER "TXLATECOL" -->
        <register>
          <name>TXLATECOL</name>
          <description>Number of frames aborted due to late collision error. </description>
          <addressOffset>0x158</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "TXEXESSCOL" -->
        <register>
          <name>TXEXESSCOL</name>
          <description>Number of frames aborted due to excessive (16) collision errors. </description>
          <addressOffset>0x15C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "TXCARRIERERROR" -->
        <register>
          <name>TXCARRIERERROR</name>
          <description>Number of frames aborted due to carrier sense error (no carrier or loss of carrier).  </description>
          <addressOffset>0x160</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "TXOCTETCOUNT_G" -->
        <register>
          <name>TXOCTETCOUNT_G</name>
          <description>Number of bytes transmitted, exclusive of preamble, in good frames only. </description>
          <addressOffset>0x164</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "TXFRAMECOUNT_G" -->
        <register>
          <name>TXFRAMECOUNT_G</name>
          <description>Number of good frames transmitted. </description>
          <addressOffset>0x168</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "TXEXECESSDEF_G" -->
        <register>
          <name>TXEXECESSDEF_G</name>
          <description>Number of frames aborted due to excessive deferral error (deferred for more than two max-sized frame times).</description>
          <addressOffset>0x16C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "TXPAUSEFRAMES" -->
        <register>
          <name>TXPAUSEFRAMES</name>
          <description>Number of good PAUSE frames transmitted. </description>
          <addressOffset>0x170</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "TXVLANFRAMES_G" -->
        <register>
          <name>TXVLANFRAMES_G</name>
          <description>Number of good VLAN frames transmitted, exclusive of retried frames. </description>
          <addressOffset>0x174</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RXFRAMECOUNT_GB" -->
        <register>
          <name>RXFRAMECOUNT_GB</name>
          <description>Number of good and bad frames received. </description>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RXOCTETCOUNT_GB" -->
        <register>
          <name>RXOCTETCOUNT_GB</name>
          <description>Number of bytes received, exclusive of preamble, in good and bad frames.  </description>
          <addressOffset>0x184</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RXOCTETCOUNT_G" -->
        <register>
          <name>RXOCTETCOUNT_G</name>
          <description>Number of bytes received, exclusive of preamble, only in good frames. </description>
          <addressOffset>0x188</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RXBROADCASTFRAMES_G" -->
        <register>
          <name>RXBROADCASTFRAMES_G</name>
          <description>Number of good broadcast frames received. </description>
          <addressOffset>0x18C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RXMULTICASTFRAMES_G" -->
        <register>
          <name>RXMULTICASTFRAMES_G</name>
          <description>Number of good multicast frames received. </description>
          <addressOffset>0x190</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RXCRCERROR" -->
        <register>
          <name>RXCRCERROR</name>
          <description>Number of frames received with CRC error. </description>
          <addressOffset>0x194</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RXALLIGNMENTERROR" -->
        <register>
          <name>RXALLIGNMENTERROR</name>
          <description>Number of frames received with alignment (dribble) error. Valid only in 10/100 mode. </description>
          <addressOffset>0x198</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RXRUNTERROR" -->
        <register>
          <name>RXRUNTERROR</name>
          <description>Number of frames received with runt (64 bytes and CRC error) error. </description>
          <addressOffset>0x19C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RXJABBERERROR" -->
        <register>
          <name>RXJABBERERROR</name>
          <description>Number of frames received with length greater than 1518 bytes with CRC error. </description>
          <addressOffset>0x1A0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RXUNDERSIZE_G" -->
        <register>
          <name>RXUNDERSIZE_G</name>
          <description>Number of frames received with length less than 64 bytes, without any errors.  </description>
          <addressOffset>0x1A4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RXOVERSIZE_G" -->
        <register>
          <name>RXOVERSIZE_G</name>
          <description>Number of frames received with length greater than the maxsize without error. </description>
          <addressOffset>0x1A8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RX64OCTETS_GB" -->
        <register>
          <name>RX64OCTETS_GB</name>
          <description>Number of good and bad frames received with length 64 bytes, exclusive of preamble. </description>
          <addressOffset>0x1AC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RX65TO127OCTETS_GB" -->
        <register>
          <name>RX65TO127OCTETS_GB</name>
          <description>Number of good and bad frames received with length between 65 and 127 (inclusive) bytes, exclusive of preamble.  </description>
          <addressOffset>0x1B0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RX128TO255OCTETS_GB" -->
        <register>
          <name>RX128TO255OCTETS_GB</name>
          <description>Number of good and bad frames received with length between 128 and 255 (inclusive) bytes, exclusive of preamble.  </description>
          <addressOffset>0x1B4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RX256TO511OCTETS_GB" -->
        <register>
          <name>RX256TO511OCTETS_GB</name>
          <description>Number of good and bad frames received with length between 256 and 511 (inclusive) bytes, exclusive of preamble.  </description>
          <addressOffset>0x1B8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
